---
kind: property
id: P:Autodesk.Revit.DB.Lighting.AdvancedLossFactor.BallastLossFactor
source: html/2bc09702-aae7-d999-7f9a-3758a256e863.htm
---
# Autodesk.Revit.DB.Lighting.AdvancedLossFactor.BallastLossFactor Property

The ballast loss factor.

## Syntax (C#)
```csharp
public double BallastLossFactor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The loss factor is not valid because it is not between 0.0 and 1.0.